#include<stdio.h>
#include<string.h>
#define size 10

void main()
{
	char name[size][9] = { "정원민","임지훈","이정훈","경태현","임꺽정","정원민","슈왈츠","제네거","김홍백","김청백" };
	char phone[size][14] = { "010-6375-3954","010-4564-3954","010-4235-4238","412-5465-4235","452-1245-5468","132-1254-3548","453-1248-5324","421-1248-4532","457-1324-5432","051-6455-4512" };
	double grade[size] = { 3.8,3.7,3.6,3.5,3.4,3.3,4.0,3.9,4.1,4.2 };
	char who[9];
	int cnt, i;

	printf("정보를 찾고 싶은 학생의 이름 : ");
	gets_s(who); //2011년 이후 gets함수가 삭제되어 2017버젼에서는 gets_s를 대체함수로 사용했습니다.

	printf("\n\n");
	printf("==========================================\n");
	printf("  이름         전화번호          평점 \n");
	printf("==========================================\n");

	cnt = 0;
	for (i = 0; i < size; i++) {
		if (strcmp(who, name[i]) == 0) {
			cnt++;
			printf(" %-10s   %-14s    %5.1lf \n", name[i], phone[i], grade[i]);
		}
	}
	printf("==========================================\n");
	if (cnt == 0)
	{
		printf(" %s(이)라는 학생은 없습니다. \n", who);
		printf("총%d명의 학생을 찾았습니다.", cnt);
	}
	else
		printf("총%d명의 학생을 찾았습니다.", cnt);
}